
from manim import *

class LyricsVideo(Scene):
    def construct(self):        
        lyrics = [[18.0,27.1,"散落的月光 穿过了云"],[35.35,44.25,"时间包围着你 循环带你回去"],[27.1,35.35,"离开人群 成为黑洞的星"],[44.25,52.55,"时间轮回重启 妄想击垮你"],[52.55,62.1,"在夜的深处醒 凝望永恒的冰凝"],[62.1,70.5,"灵魂永困此境 无人带你逃离"],[70.5,73.4,"你希望找到凶手的痕迹"],[73.4,75.8,"捞起江底的尸体"],[75.8,79.45,"你说在我的时空也要还她正义"],[79.45,82.5,"你和我探寻时空定理"],[82.5,84.65,"找寻蛛丝马迹"],[84.65,88.25,"世界能否不再"],[88.25,93.0,"总让你被困在重复的每天"],[93.0,97.6,"一切平凡生活都只能期盼"],[97.6,103.5,"人间满是留恋 全都在眼前"][138.0,147.05,"散落的月光 穿过了云"],[147.05,155.45,"离开人群 宛若流星"],[155.45,164.25,"有人正在帮你 他想陪伴你"],[164.25,172.75,"存在一线生机 一定带你逃离"],[172.75,175.95,"你不怕无尽循环的孤寂"],[175.95,178.15,"一次次蒸发重启"],[178.15,181.85,"即使需以身为刃也要寻求正义"],[181.85,184.85,"你说你余生都在这里"],[184.85,187.0,"已没有人陪你"],[187.0,190.85,"世界已然将你抛弃"],[190.85,195.3,"漆黑夜空像你晦暗的双眼"],[195.3,199.85,"腊月寒冬与你最后的陪伴"],[199.85,205.6,"人间一切留恋 消散在眼前"],[208.05,212.7,"来不及 来不及"],[212.7,217.15,"你曾笑着哭泣"],[217.15,221.6,"来不及 来不及"],[221.6,226.05,"如何将你救起"],[226.05,230.45,"寒冬去 暖春至"],[230.45,235.0,"你仍困住循环里"],[235.0,239.85,"蒸发弃 轮回启"],[239.85,243.7,"你明明不曾放弃"]]
        for lyric in lyrics:
            text = Text(lyric[2])
            self.play(Write(text), run_time=2.0)
            t=lyric[1] - lyric[0] - 3.0
            if(t>0):
                self.wait(t)  # 等待到歌词结束
            self.play(FadeOut(text), run_time=1.0)
            self.wait(0.5)  # 等待0.5秒再显示下一句歌词
                        
        