from manim import *


class LyricsVideo(Scene):
    def construct(self):
        lyrics = [
            [40.684, 45.119, "眼前的黑剩多久"],
            [45.119, 48.656, "还要多久"],
            [48.656, 54.254, "才能承受"],
            [54.254, 58.946, "那边的天有多蓝"],
            [58.946, 62.069, "日有多暖"],
            [62.069, 68.717, "等待的时间会有多长"],
            [68.717, 73.135, "你要相信我会回来"],
            [73.135, 81.182, "即使我们的距离还在光年外"],
            [81.182, 84.345, "曲折坎总会蜿蜒"],
            [84.345, 88.144, "沿天际的轨线"],
            [88.144, 92.11, "不再背负的"],
            [92.11, 105.683, "那天"],
            [105.683, 109.215, "探索着浩瀚的宇宙"],
            [109.215, 114.301, "守护这脆弱的星球"],
            [114.301, 119.393, "不知哪何时何分"],
            [119.393, 122.891, "你是我最大的信念"],
            [122.891, 129.074, "使命让我如此勇敢"],
            [129.074, 135.673, "生而为 既无畏"],
            [135.673, 140.013, "你要相信我会回来"],
            [140.013, 148.143, "即使我们的距离还在光年外oh"],
            [148.143, 151.211, "曲折坎总会蜿蜒"],
            [151.211, 154.988, "沿天际的轨线"],
            [154.988, 160.63, "背负一切都 值得"],
            [160.63, 163.544, "当云散"],
            [163.544, 167.375, "那份诺言会兑现"],
            [167.375, 170.539, "我们会手牵着手"],
            [170.539, 175.304, "望星辰大海"],
            [175.304, 179.001, "炽热将寒夜驱赶"],
            [179.001, 182.401, "黎明会重返"],
            [182.401, 185.766, "旅途的终点"],
            [185.766, 188.832, "一切都还原"],
            [188.832, 204.258, "那天"],
            [204.258, 208.6, "你要相信我会回来"],
            [208.6, 216.647, "即使我们的距离还在光年外"],
            [216.647, 219.729, "曲折坎总会蜿蜒"],
            [219.729, 223.512, "沿天际的轨线"],
            [223.512, 229.252, "背负一切都 值得"],
            [229.252, 232.144, "当风唤"],
            [232.144, 235.938, "那份诺言会兑现"],
            [235.938, 239.164, "我们会手牵着手"],
            [239.164, 244.087, "望星辰大海"],
            [244.087, 247.601, "炽热将寒夜驱赶"],
            [247.601, 254.396, "黎明重返"],
            [254.396, 263.955, "地平线终点"],
            [263.955, 269.999, "团圆"],
        ]

        for lyric in lyrics:
            text = Text(lyric[2])
            self.play(Write(text), run_time=2.0)
            t = lyric[1] - lyric[0] - 3.0
            if t > 0:
                self.wait(t)  # 等待到歌词结束
            self.play(FadeOut(text), run_time=1.0)
        self.wait()
