from manim import *
#           manim "C:\manim_projects\gzlm\3.py" -p

class LyricsVideo(Scene):
    def construct(self):
        lyrics = [
            # [18.100, 26.770, "暗红星球的天际，没有归期"],
            # [26.770, 35.720, "迷惘的眼睛，消失在远行的蓝星"],
            # [35.720, 44.520, "暗红星球的天际，渐渐沉寂"],
            # [44.520, 52.310, "渺茫的希望，拼尽着全力的毅力"],
            # [52.310, 57.650, "我祈祷猎鹰飞上空间轨道里"],
            # [57.650, 63.130, "满载着生机与希冀"],
            # [63.130, 66.450, "给我一个晴朗的天气"],
            # [66.450, 70.310, "再让猎鹰飞上天际"],
            # [70.310, 75.100, "每当星光透射进你舷窗里"],
            # [75.100, 80.800, "每当太阳照常升起"],
            # [80.800, 84.270, "四百公里的天际"],
            # [84.270, 98.800, "我们不再会远离"],
            [98.800, 106.750, "夜空中牵挂的星 无尽长旅"],
            [106.750, 115.720, "曾同我守候 的身影如今在哪里"],
            [115.720, 124.170, "夜空中牵挂的星 不再远离"],
            [124.170, 132.310, "再让我聆听 那最后发出的讯息"],
            [132.310, 137.370, "我祈祷神舟飞进火星轨道里"],
            [137.370, 143.050, "早日将天边的你救起"],
            [143.050, 146.430, "让我挣脱火星的引力"],
            [146.430, 150.360, "越过谎言去拥抱你"],
            [150.360, 155.100, "每当我找不到存在的意义"],
            [155.100, 160.860, "每当我迷失在长夜里"],
            [160.860, 185.660, "夜空中牵挂的星 是你指引我前行"],
            [185.660, 190.980, "我宁愿忍受所有痛苦和孤寂"],
            [190.980, 196.320, "夺回蓝星救回你"],
            [196.320, 199.810, "给我穿越风暴的毅力"],
            [199.810, 203.610, "走上法庭遥遥星际"],
            [203.610, 208.400, "每当你独自守望着在天际"],
            [208.400, 214.070, "不愿如流星坠落大地"],
            [214.070, 217.840, "消散在火星的天际"],
            [217.840, 231.350, "能否再与你同行"],
            [231.350, 240.110, "暗红星球的曾经 有个奇迹"],
            [240.110, 248.001, "它无人知晓 藏在某个人的心底"],
        ]

        for lyric in lyrics:
            text = Text(lyric[2])
            self.play(Write(text), run_time=2.0)
            t = lyric[1] - lyric[0] - 3.0
            if t > 0:
                self.wait(t)  # 等待到歌词结束
            self.play(FadeOut(text), run_time=1.0)
        self.wait()
